src/InformationRegisters/ГрафикиРаботыПоВидамВремени/ГрафикиРаботыПоВидамВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикиРаботыПоВидамВремени</name>
  <comment>(Общ)</comment>
  <resources>
    <name>ОсновноеЗначение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительноеЗначение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроизводственныйКалендарьПятидневка</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроизводственныйКалендарьПятидневкаЧасы</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроизводственныйКалендарьШестидневка</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновноеЗначениеНорма</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительноеЗначениеНорма</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроизводственныйКалендарьКалендарныеДни</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновноеЗначениеПолное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительноеЗначениеПолное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновноеЗначениеНормаПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроизводственныйКалендарьКалендарныеДниПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительноеЗначениеНормаПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроизводственныйКалендарьПятидневкаПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроизводственныйКалендарьПятидневкаЧасыПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроизводственныйКалендарьШестидневкаПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроизводственныйКалендарьКалендарныеДниСПраздниками</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ВводИндивидуальныхГрафиковРаботыОрганизации</types>
      <types>DocumentRef.СдельныйНаряд</types>
      <types>DocumentRef.ТабельУчетаРабочегоВремениОрганизации</types>
    </type>
  </attributes>
  <dimensions>
    <name>ГрафикРаботы</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.СотрудникиОрганизаций</types>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>План</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУчетаВремени</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыУчетаВремени</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/РаботникиОрганизаций/РаботникиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботникиОрганизаций</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыУчетаВремени/ВидыУчетаВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУчетаВремени</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПоДням</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоЧасам</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоВечернимЧасам</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоНочнымЧасам</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ГрафикиРаботы/ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГрафикиРаботы</name>
  <comment>(Общ)</comment>
  <attributes>
    <name>ВидГрафика</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыРабочихГрафиков</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммированныйУчетРабочегоВремени</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйВыходной</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ДниНедели</types>
    </type>
  </attributes>
  <attributes>
    <name>ВторойВыходной</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ДниНедели</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтсчета</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьРабочейНедели</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СокращенноеРабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикПолногоРабочегоВремени</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДневныхЧасов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоВечернихЧасов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоНочныхЧасов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СокращеннаяРабочаяНеделя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеполныйРабочийДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПраздники</name>
    <comment>Учитывать праздники при автозаполнении графика</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВечерниеЧасы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНочныеЧасы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЗаполнения</name>
    <type>
      <types>EnumRef.ШаблонЗаполненияГрафикаРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыходныеПоСкользящемуГрафику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СокращатьКалендарныеДни</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Смены</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>НомерДня</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Смены</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПериодыСмены</name>
    <attributes>
      <name>ВремяНачала</name>
      <comment>(Общ)</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <comment>(Общ)</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ГрафикиРаботыПоВидамВремени/RecordSetModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события ПередЗаписью набора записей регистра сведений
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если  ЭтотОбъект.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	// Расчет ресурса ОсновноеЗначение.
	Если (Отбор.План.Значение = Ложь) 
		И (Отбор.План.Использование)
		И (Отбор.ГрафикРаботы.Использование) 
		И (Отбор.Сотрудник.Использование) 
		И (Отбор.Месяц.Использование) Тогда
		
		ЗапросРасчетаОсновногоЗначения = Новый Запрос;
		ЗапросРасчетаОсновногоЗначения.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ЗапросРасчетаОсновногоЗначения.УстановитьПараметр("Месяц", Отбор.Месяц.Значение);
		ЗапросРасчетаОсновногоЗначения.УстановитьПараметр("ГрафикРаботы", Отбор.ГрафикРаботы.Значение);
		ЗапросРасчетаОсновногоЗначения.УстановитьПараметр("Сотрудник", Отбор.Сотрудник.Значение);
		Сотрудник = Отбор.ГрафикРаботы.Значение;
		
		ПоРеглУчету = ТипЗнч(Отбор.ГрафикРаботы.Значение) = Тип("СправочникСсылка.СотрудникиОрганизаций");
		ИмяТаблицы = "Работники" + ?(ПоРеглУчету, "Организаций", "");
		ИмяСправочника = ?(ПоРеглУчету, "СотрудникиОрганизаций", "ФизическиеЛица");
		ИмяПоля = ?(ПоРеглУчету, "Сотрудник", "ФизЛицо");
		ВнешнийНабор = ЭтотОбъект.Выгрузить();
		ЗапросРасчетаОсновногоЗначения.УстановитьПараметр("ИсточникДанных",ВнешнийНабор);
		
		ЗапросРасчетаОсновногоЗначения.Текст = 
		"ВЫБРАТЬ
		|       ЗаписьНабора.ГрафикРаботы,
		|       ЗаписьНабора.Сотрудник,
		|		ЗаписьНабора.ВидУчетаВремени,
		|		ЗаписьНабора.Дата,
		|		ЗаписьНабора.ОсновноеЗначение,
		|		ЗаписьНабора.ДополнительноеЗначение,
		|		ЗаписьНабора.ПроизводственныйКалендарьПятидневкаПолное,
		|		ЗаписьНабора.ПроизводственныйКалендарьПятидневкаЧасыПолное,
		|		ЗаписьНабора.ПроизводственныйКалендарьШестидневкаПолное,
		|		ЗаписьНабора.ПроизводственныйКалендарьКалендарныеДниПолное,
		|		ЗаписьНабора.ОсновноеЗначениеНормаПолное,
		|		ЗаписьНабора.ДополнительноеЗначениеНормаПолное,
		|		ЗаписьНабора.ПроизводственныйКалендарьПятидневка,
		|		ЗаписьНабора.ПроизводственныйКалендарьПятидневкаЧасы,
		|		ЗаписьНабора.ПроизводственныйКалендарьШестидневка,
		|		ЗаписьНабора.ПроизводственныйКалендарьКалендарныеДни,
		|		ЗаписьНабора.ОсновноеЗначениеНорма,
		|		ЗаписьНабора.ДополнительноеЗначениеНорма,
		|       ЗаписьНабора.Документ,
		|		ЗаписьНабора.ОсновноеЗначениеПолное,
		|		ЗаписьНабора.ДополнительноеЗначениеПолное,
		|		ЗаписьНабора.Месяц,
		|		ЗаписьНабора.План
		|ПОМЕСТИТЬ ВТЗаписиРегистра
		|ИЗ &ИсточникДанных КАК ЗаписьНабора
		|";
		ЗапросРасчетаОсновногоЗначения.Выполнить();
		
		ЗапросРасчетаОсновногоЗначения.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Графики.ГрафикРаботы
		|ИЗ
		|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК Графики
		|ГДЕ
		|	Графики.ГрафикРаботы = &ГрафикРаботы
		|	И Графики.Сотрудник = &Сотрудник
		|	И Графики.Месяц = &Месяц
		|	И Графики.План = ИСТИНА";
		
		Если ЗапросРасчетаОсновногоЗначения.Выполнить().Выбрать().Количество() = 1 Тогда
			// применяем индивидуальный график
			
			ЗапросРасчетаОсновногоЗначения.Текст = 
			"ВЫБРАТЬ
			|	ЗаписьНабора.ГрафикРаботы,
			|	ЗаписьНабора.Сотрудник,
			|	ЗаписьНабора.ВидУчетаВремени,
			|	ЗаписьНабора.Дата,
			|	ЗаписьНабора.ОсновноеЗначениеПолное - РасчетОсновногоЗначения.ОсновноеЗначение КАК ОсновноеЗначение,
			|	ЗаписьНабора.ДополнительноеЗначениеПолное - РасчетОсновногоЗначения.ДополнительноеЗначение КАК ДополнительноеЗначение,
			|	РасчетОсновногоЗначения.ПроизводственныйКалендарьПятидневка КАК ПроизводственныйКалендарьПятидневкаПолное,
			|	РасчетОсновногоЗначения.ПроизводственныйКалендарьПятидневкаЧасы КАК ПроизводственныйКалендарьПятидневкаЧасыПолное,
			|	РасчетОсновногоЗначения.ПроизводственныйКалендарьШестидневка КАК ПроизводственныйКалендарьШестидневкаПолное,
			|	РасчетОсновногоЗначения.ПроизводственныйКалендарьКалендарныеДни КАК ПроизводственныйКалендарьКалендарныеДниПолное,
			|	РасчетОсновногоЗначения.ОсновноеЗначениеНорма КАК ОсновноеЗначениеНормаПолное,
			|	РасчетОсновногоЗначения.ДополнительноеЗначениеНорма КАК ДополнительноеЗначениеНормаПолное,
			|	0 КАК ПроизводственныйКалендарьПятидневка,
			|	0 КАК ПроизводственныйКалендарьПятидневкаЧасы,
			|	0 КАК ПроизводственныйКалендарьШестидневка,
			|	0 КАК ПроизводственныйКалендарьКалендарныеДни,
			|	0 КАК ОсновноеЗначениеНорма,
			|	0 КАК ДополнительноеЗначениеНорма,
			|	ЗаписьНабора.Документ,
			|	ЗаписьНабора.ОсновноеЗначениеПолное,
			|	ЗаписьНабора.ДополнительноеЗначениеПолное,
			|	ЗаписьНабора.Месяц,
			|	ЗаписьНабора.План
			|ИЗ
			|	ВТЗаписиРегистра КАК ЗаписьНабора
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК РасчетОсновногоЗначения
			|		ПО ЗаписьНабора.ГрафикРаботы = РасчетОсновногоЗначения.ГрафикРаботы
			|			И ЗаписьНабора.Сотрудник = РасчетОсновногоЗначения.Сотрудник
			|			И (РасчетОсновногоЗначения.Месяц = &Месяц)
			|			И (РасчетОсновногоЗначения.План)
			|			И ЗаписьНабора.Дата = РасчетОсновногоЗначения.Дата
			|			И ЗаписьНабора.ВидУчетаВремени = РасчетОсновногоЗначения.ВидУчетаВремени";
			
		Иначе
			// применяем общие графики
			// формируем временную таблицу с общими графиками работы
		
			Месяц = Отбор.Месяц.Значение;
			ГодМесяц = Формат(Месяц, "ДФ=""гггг,ММ,""");
			
			ТекстЗапроса = "ВЫБРАТЬ ДАТАВРЕМЯ("+ ГодМесяц +  "1) КАК Дата ПОМЕСТИТЬ ВТДаты";
			Для Число = 2 По День(КонецМесяца(Месяц)) Цикл
				ТекстЗапроса = ТекстЗапроса + "
				|ОБЪЕДИНИТЬ ВСЕ 
				|ВЫБРАТЬ ДАТАВРЕМЯ("+ ГодМесяц + Число + ")";
			КонецЦикла;
			
			ЗапросРасчетаОсновногоЗначения.Текст = ТекстЗапроса;
			ЗапросРасчетаОсновногоЗначения.Выполнить();
			
			ЗапросРасчетаОсновногоЗначения.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
            |   Даты.Дата КАК Дата,
            |   РаботникиОрганизаций.ГрафикРаботы КАК ГрафикРаботы
            |ПОМЕСТИТЬ ВТДатыГрафики
            |ИЗ
            |   (ВЫБРАТЬ
            |       Даты.Дата КАК Дата,
            |       ЕСТЬNULL(ОпределениеГрафикаСрезПоследних.ДатаОпределенияГрафика, ОпределениеГрафикаСрезПервых.ДатаОпределенияГрафика) КАК ДатаОпределенияГрафика
            |   ИЗ
            |       ВТДаты КАК Даты
            |           ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
            |               МАКСИМУМ(РаботникиОрганизаций.Период) КАК ДатаОпределенияГрафика,
            |               Даты.Дата КАК Дата
            |           ИЗ
            |               ВТДаты КАК Даты
            |                   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
            |                   ПО (РаботникиОрганизаций.Сотрудник = &Сотрудник)
            |                       И Даты.Дата >= РаботникиОрганизаций.Период
            |           
            |           СГРУППИРОВАТЬ ПО
            |               Даты.Дата) КАК ОпределениеГрафикаСрезПоследних
            |           ПО (ОпределениеГрафикаСрезПоследних.Дата = Даты.Дата)
            |           ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
            |               МИНИМУМ(РаботникиОрганизаций.Период) КАК ДатаОпределенияГрафика,
            |               Даты.Дата КАК Дата
            |           ИЗ
            |               ВТДаты КАК Даты
            |                   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
            |                   ПО (РаботникиОрганизаций.Сотрудник = &Сотрудник)
            |                       И Даты.Дата <= РаботникиОрганизаций.Период
            |           
            |           СГРУППИРОВАТЬ ПО
            |               Даты.Дата) КАК ОпределениеГрафикаСрезПервых
            |           ПО (ОпределениеГрафикаСрезПервых.Дата = Даты.Дата)) КАК Даты
            |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
            |       ПО (РаботникиОрганизаций.Сотрудник = &Сотрудник)
            |           И Даты.ДатаОпределенияГрафика = РаботникиОрганизаций.Период
            |
            |ИНДЕКСИРОВАТЬ ПО
            |   Дата,
            |   ГрафикРаботы";
			ЗапросРасчетаОсновногоЗначения.Выполнить();
			
			ЗапросРасчетаОсновногоЗначения.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
            |   ЗаписьНабора.ГрафикРаботы,
            |   ЗаписьНабора.Сотрудник,
            |   ЗаписьНабора.ВидУчетаВремени,
            |   ЗаписьНабора.Дата,
            |   ЗаписьНабора.ОсновноеЗначениеПолное КАК ОсновноеЗначение,
            |   ЗаписьНабора.ДополнительноеЗначениеПолное КАК ДополнительноеЗначение,
            |   РасчетОсновногоЗначения.ПроизводственныйКалендарьПятидневка КАК ПроизводственныйКалендарьПятидневкаПолное,
            |   РасчетОсновногоЗначения.ПроизводственныйКалендарьПятидневкаЧасы КАК ПроизводственныйКалендарьПятидневкаЧасыПолное,
            |   РасчетОсновногоЗначения.ПроизводственныйКалендарьШестидневка КАК ПроизводственныйКалендарьШестидневкаПолное,
            |   РасчетОсновногоЗначения.ПроизводственныйКалендарьКалендарныеДни КАК ПроизводственныйКалендарьКалендарныеДниПолное,
            |   РасчетОсновногоЗначения.ОсновноеЗначениеНорма КАК ОсновноеЗначениеНормаПолное,
            |   РасчетОсновногоЗначения.ДополнительноеЗначениеНорма КАК ДополнительноеЗначениеНормаПолное,
            |   РасчетОсновногоЗначения.ПроизводственныйКалендарьПятидневка КАК ПроизводственныйКалендарьПятидневка,
            |   РасчетОсновногоЗначения.ПроизводственныйКалендарьПятидневкаЧасы КАК ПроизводственныйКалендарьПятидневкаЧасы,
            |   РасчетОсновногоЗначения.ПроизводственныйКалендарьШестидневка КАК ПроизводственныйКалендарьШестидневка,
            |   РасчетОсновногоЗначения.ПроизводственныйКалендарьКалендарныеДни КАК ПроизводственныйКалендарьКалендарныеДни,
            |   РасчетОсновногоЗначения.ОсновноеЗначениеНорма КАК ОсновноеЗначениеНорма,
            |   РасчетОсновногоЗначения.ДополнительноеЗначениеНорма КАК ДополнительноеЗначениеНорма,
            |   ЗаписьНабора.Документ,
            |   ЗаписьНабора.ОсновноеЗначениеПолное,
            |   ЗаписьНабора.ДополнительноеЗначениеПолное,
            |   ЗаписьНабора.Месяц,
            |   ЗаписьНабора.План
            |ИЗ
            |   ВТЗаписиРегистра КАК ЗаписьНабора
            |       ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыГрафики КАК ДатыГрафики
            |       ПО (ДатыГрафики.Дата = ЗаписьНабора.Дата)
            |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК РасчетОсновногоЗначения
            |       ПО (ДатыГрафики.ГрафикРаботы = РасчетОсновногоЗначения.ГрафикРаботы)
            |           И (РасчетОсновногоЗначения.Месяц = &Месяц)
            |           И (РасчетОсновногоЗначения.План)
            |           И ЗаписьНабора.Дата = РасчетОсновногоЗначения.Дата
            |           И ЗаписьНабора.ВидУчетаВремени = РасчетОсновногоЗначения.ВидУчетаВремени";
			
		КонецЕсли;
		ЭтотОбъект.Загрузить(ЗапросРасчетаОсновногоЗначения.Выполнить().Выгрузить());
		
	
	ИначеЕсли ТипЗнч(Отбор.ГрафикРаботы.Значение) = Тип("СправочникСсылка.ГрафикиРаботы") Тогда
		
		ГрафикРаботы = Отбор.ГрафикРаботы.Значение;
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ГрафикРаботы);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикиРаботы.ГрафикПолногоРабочегоВремени,
		|	ГрафикиРаботы.СокращенноеРабочееВремя,
		|	ГрафикиРаботы.СокращатьКалендарныеДни
		|ИЗ
		|	Справочник.ГрафикиРаботы КАК ГрафикиРаботы
		|ГДЕ
		|	ГрафикиРаботы.Ссылка = &Ссылка";
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ГрафикПолногоРабочегоВремени = Выборка.ГрафикПолногоРабочегоВремени;
		ТребуетсяНормаДругогоГрафика = Выборка.СокращенноеРабочееВремя И Не ГрафикПолногоРабочегоВремени.Пустая();
		СокращатьКалендарныеДни = Выборка.СокращатьКалендарныеДни И Не ГрафикПолногоРабочегоВремени.Пустая();
		
		СоответствиеМесяцев = Новый Соответствие;
		Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
			ЗаписьНабора.Месяц = НачалоМесяца(ЗаписьНабора.Дата);
			Если Не ТребуетсяНормаДругогоГрафика Тогда
				Если ЗаписьНабора.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням Или ЗаписьНабора.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам Тогда
					ЗаписьНабора.ОсновноеЗначениеНорма = ЗаписьНабора.ОсновноеЗначение;
					ЗаписьНабора.ДополнительноеЗначениеНорма = ЗаписьНабора.ДополнительноеЗначение;
				КонецЕсли;
			Иначе 	
				СоответствиеМесяцев.Вставить(ЗаписьНабора.Месяц);
			КонецЕсли;
		КонецЦикла;
		
		Если ТребуетсяНормаДругогоГрафика Тогда
			
			МассивМесяцев = Новый Массив;
			Для каждого Элемент Из СоответствиеМесяцев Цикл
				МассивМесяцев.Добавить(Элемент.Ключ)
			КонецЦикла; 
			
			Запрос.УстановитьПараметр("МассивМесяцев", МассивМесяцев);
			Запрос.УстановитьПараметр("парамГрафикПолногоРабочегоВремени", ГрафикПолногоРабочегоВремени);
			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ГрафикиРаботыПоВидамВремени.Дата,
			|	ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма КАК НормаДней,
			|	ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма КАК НормаЧасов
			|ИЗ
			|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
			|ГДЕ
			|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &парамГрафикПолногоРабочегоВремени
			|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
			|	И НАЧАЛОПЕРИОДА(ГрафикиРаботыПоВидамВремени.Дата, МЕСЯЦ) В (&МассивМесяцев)";
			
			ДанныеНормыВремени = Запрос.Выполнить().Выгрузить();
			ДанныеНормыВремени.Индексы.Добавить("Дата");
			Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
				НормаДней = 0;
				НормаЧасов = 0;	
				НайденнаяСтрока = ДанныеНормыВремени.Найти(ЗаписьНабора.Дата, "Дата");
				Если НайденнаяСтрока <> Неопределено Тогда
					НормаДней = НайденнаяСтрока.НормаДней;
					НормаЧасов = НайденнаяСтрока.НормаЧасов;
				КонецЕсли;
				Если ЗаписьНабора.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням Тогда 
					ЗаписьНабора.ОсновноеЗначениеНорма = НормаДней;
					ЗаписьНабора.ДополнительноеЗначениеНорма = НормаЧасов;
				ИначеЕсли ЗаписьНабора.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам Тогда	
					ЗаписьНабора.ОсновноеЗначениеНорма = НормаЧасов;      
					ЗаписьНабора.ДополнительноеЗначениеНорма = НормаДней;
				КонецЕсли;
				
				Если СокращатьКалендарныеДни Тогда
					Если ЗаписьНабора.ОсновноеЗначениеНорма > 0 И ЗаписьНабора.ОсновноеЗначение = 0 Тогда
						ЗаписьНабора.ПроизводственныйКалендарьКалендарныеДни = 0;
					Конецесли;	
					
				Конецесли;	
					
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
		ЗаписьНабора.ПроизводственныйКалендарьКалендарныеДниСПраздниками = 1;
	КонецЦикла;

	
КонецПроцедуры

// Обработчик события ПриЗаписи набора записей регистра сведений
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если (Отбор.План.Значение = Истина) И (Отбор.План.Использование)
		И (Отбор.ГрафикРаботы.Использование) И (Отбор.Месяц.Использование) Тогда
		// Перезапись набора записей с отбором по План = Ложь
		НаборЗаписейФакта = РегистрыСведений.ГрафикиРаботыПоВидамВремени.СоздатьНаборЗаписей();
		НаборЗаписейФакта.Отбор.План.Установить(Ложь);
		НаборЗаписейФакта.Отбор.ГрафикРаботы.Установить(Отбор.ГрафикРаботы.Значение);
		НаборЗаписейФакта.Отбор.Сотрудник.Установить(Отбор.Сотрудник.Значение);
		НаборЗаписейФакта.Отбор.Месяц.Установить(Отбор.Месяц.Значение);
		НаборЗаписейФакта.Прочитать();
		Если НаборЗаписейФакта.Количество() <> 0 Тогда
			НаборЗаписейФакта.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
